In [1]:
import pandas as pd

In [3]:
data1 = {'Name':['Mahesh','Kajal','Prabhas','Priya','Ramcharan','Samnatha'],
         'Marks':[98,89,99,87,90,83],
         'Gender': ['Male','Female','Male','Female','Male','Female']
        }
df1 = pd.DataFrame(data1)
df1

        Name  Marks  Gender
0     Mahesh     98    Male
1      Kajal     89  Female
2    Prabhas     99    Male
3      Priya     87  Female
4  Ramcharan     90    Male
5   Samnatha     83  Female

1. Display Top 3 Rows of the Dataset

In [4]:
df1.head(3)

      Name  Marks  Gender
0   Mahesh     98    Male
1    Kajal     89  Female
2  Prabhas     99    Male

2. Display last 3 Rows of the Dataset

In [5]:
df1.tail(3)

        Name  Marks  Gender
3      Priya     87  Female
4  Ramcharan     90    Male
5   Samnatha     83  Female

3. Find Shape of Our Dataset (Rows & Columns)

In [6]:
df1.shape

(6, 3)

In [9]:
df1.shape[0] # Rows

6

In [10]:
df1.shape[1] # columns

3

4. Get information About Our Dataset

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

5. Check Null Values In the Dataset

In [12]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False

In [15]:
df1.isnull().sum(axis = 0)

Name      0
Marks     0
Gender    0
dtype: int64

6. Get Overall Statistics About the DataFrame

In [16]:
df1.describe()

           Marks
count   6.000000
mean   91.000000
std     6.292853
min    83.000000
25%    87.500000
50%    89.500000
75%    96.000000
max    99.000000

In [17]:
df1.describe(include='all')

          Name      Marks Gender
count        6   6.000000      6
unique       6        NaN      2
top     Mahesh        NaN   Male
freq         1        NaN      3
mean       NaN  91.000000    NaN
std        NaN   6.292853    NaN
min        NaN  83.000000    NaN
25%        NaN  87.500000    NaN
50%        NaN  89.500000    NaN
75%        NaN  96.000000    NaN
max        NaN  99.000000    NaN

7. Find the Unique Values from the Gender column

In [20]:
df1

        Name  Marks  Gender
0     Mahesh     98    Male
1      Kajal     89  Female
2    Prabhas     99    Male
3      Priya     87  Female
4  Ramcharan     90    Male
5   Samnatha     83  Female

In [21]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

8. Find the Number of Unique Values from the Gender column

In [22]:
df1['Gender'].nunique()

2

9. Display Count Of Unique Values in Gender Column

In [25]:
df1['Gender'].value_counts()

Gender
Male      3
Female    3
Name: count, dtype: int64

10. Find the Total Number of Students Having Marks Between 90 to 100

In [27]:
df1[df1['Marks'].between(90,100)]

        Name  Marks Gender
0     Mahesh     98   Male
2    Prabhas     99   Male
4  Ramcharan     90   Male

11. Find Average Marks

In [28]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
Name: Marks, dtype: int64

In [29]:
df1['Marks'].mean()

91.0

12. Apply Method

In [32]:
def marks(x):
    return x//2

In [33]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
Name: Marks, dtype: int64

In [34]:
df1['Half_marks'] = df1['Marks'].apply(marks)

In [35]:
df1

        Name  Marks  Gender  Half_marks
0     Mahesh     98    Male          49
1      Kajal     89  Female          44
2    Prabhas     99    Male          49
3      Priya     87  Female          43
4  Ramcharan     90    Male          45
5   Samnatha     83  Female          41

In [37]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
Name: Marks, dtype: int64

In [38]:
df1['Name'].apply(len)

0    6
1    5
2    7
3    5
4    9
5    8
Name: Name, dtype: int64

13. Map Function

In [39]:
df1

        Name  Marks  Gender  Half_marks
0     Mahesh     98    Male          49
1      Kajal     89  Female          44
2    Prabhas     99    Male          49
3      Priya     87  Female          43
4  Ramcharan     90    Male          45
5   Samnatha     83  Female          41

In [44]:
df1['Gender'].map({'Male':1, 'Female':0})

0    1
1    0
2    1
3    0
4    1
5    0
Name: Gender, dtype: int64

In [45]:
df1['Male_Female'] = df1['Gender'].map({'Male':1, 'Female':0})

In [46]:
df1

        Name  Marks  Gender  Half_marks  Male_Female
0     Mahesh     98    Male          49            1
1      Kajal     89  Female          44            0
2    Prabhas     99    Male          49            1
3      Priya     87  Female          43            0
4  Ramcharan     90    Male          45            1
5   Samnatha     83  Female          41            0

14. Drop Name of the Columns

In [59]:
df1.drop(['Male_Female'],axis=1)

        Name  Marks  Gender  Half_marks
0     Mahesh     98    Male          49
1      Kajal     89  Female          44
2    Prabhas     99    Male          49
3      Priya     87  Female          43
4  Ramcharan     90    Male          45
5   Samnatha     83  Female          41

In [60]:
df1.drop(['Half_marks'],axis=1)

        Name  Marks  Gender  Male_Female
0     Mahesh     98    Male            1
1      Kajal     89  Female            0
2    Prabhas     99    Male            1
3      Priya     87  Female            0
4  Ramcharan     90    Male            1
5   Samnatha     83  Female            0

15. Print Name of the Columns

In [61]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks', 'Male_Female'], dtype='object')

In [62]:
df1.index

RangeIndex(start=0, stop=6, step=1)

16. Sort The DataFrame

In [63]:
df1

        Name  Marks  Gender  Half_marks  Male_Female
0     Mahesh     98    Male          49            1
1      Kajal     89  Female          44            0
2    Prabhas     99    Male          49            1
3      Priya     87  Female          43            0
4  Ramcharan     90    Male          45            1
5   Samnatha     83  Female          41            0

In [57]:
df1.sort_values(by='Marks')

        Name  Marks  Gender  Half_marks  Male_Female
5   Samnatha     83  Female          41            0
3      Priya     87  Female          43            0
1      Kajal     89  Female          44            0
4  Ramcharan     90    Male          45            1
0     Mahesh     98    Male          49            1
2    Prabhas     99    Male          49            1

In [58]:
df1.sort_values(by='Marks', ascending=False)

        Name  Marks  Gender  Half_marks  Male_Female
2    Prabhas     99    Male          49            1
0     Mahesh     98    Male          49            1
4  Ramcharan     90    Male          45            1
1      Kajal     89  Female          44            0
3      Priya     87  Female          43            0
5   Samnatha     83  Female          41            0

In [66]:
df1.drop(['Half_marks','Male_Female'],axis=1)

        Name  Marks  Gender
0     Mahesh     98    Male
1      Kajal     89  Female
2    Prabhas     99    Male
3      Priya     87  Female
4  Ramcharan     90    Male
5   Samnatha     83  Female

In [67]:
df1.sort_values(by='Marks', ascending=False)

        Name  Marks  Gender  Half_marks  Male_Female
2    Prabhas     99    Male          49            1
0     Mahesh     98    Male          49            1
4  Ramcharan     90    Male          45            1
1      Kajal     89  Female          44            0
3      Priya     87  Female          43            0
5   Samnatha     83  Female          41            0

In [68]:
df1.sort_values(by=['Marks','Gender'], ascending=False)

        Name  Marks  Gender  Half_marks  Male_Female
2    Prabhas     99    Male          49            1
0     Mahesh     98    Male          49            1
4  Ramcharan     90    Male          45            1
1      Kajal     89  Female          44            0
3      Priya     87  Female          43            0
5   Samnatha     83  Female          41            0

17. Display Name & Marks of The Female Students

In [69]:
df1

        Name  Marks  Gender  Half_marks  Male_Female
0     Mahesh     98    Male          49            1
1      Kajal     89  Female          44            0
2    Prabhas     99    Male          49            1
3      Priya     87  Female          43            0
4  Ramcharan     90    Male          45            1
5   Samnatha     83  Female          41            0

In [70]:
df1['Gender']

0      Male
1    Female
2      Male
3    Female
4      Male
5    Female
Name: Gender, dtype: object

In [75]:
df1[df1['Gender']=='Female'][['Name', 'Marks']]

       Name  Marks
1     Kajal     89
3     Priya     87
5  Samnatha     83

In [77]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

       Name  Marks
1     Kajal     89
3     Priya     87
5  Samnatha     83

-> Completed